; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-1-3-2-222)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-0 - location
	p1-2 - location
	p5-1 - location
	p5-2 - location
	p5-3 - location
	p2-0 - location
	p3-0 - location
	p3-2 - location
	p4-0 - location
	p4-3 - location
	p4-5 - location
	p6-2 - location
	p6-4 - location
	)
	(:init
	(at driver1 s1)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s3)
	(at package2 s0)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 1)
	(= (time-to-walk p1-0 s1) 1)
	(= (time-to-walk s0 p1-0) 23)
	(= (time-to-walk p1-0 s0) 23)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 4)
	(= (time-to-walk p1-2 s1) 4)
	(= (time-to-walk s2 p1-2) 18)
	(= (time-to-walk p1-2 s2) 18)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 23)
	(= (time-to-walk p5-1 s5) 23)
	(= (time-to-walk s1 p5-1) 3)
	(= (time-to-walk p5-1 s1) 3)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 7)
	(= (time-to-walk p5-2 s5) 7)
	(= (time-to-walk s2 p5-2) 27)
	(= (time-to-walk p5-2 s2) 27)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 21)
	(= (time-to-walk p5-3 s5) 21)
	(= (time-to-walk s3 p5-3) 38)
	(= (time-to-walk p5-3 s3) 38)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 1)
	(= (time-to-walk p2-0 s2) 1)
	(= (time-to-walk s0 p2-0) 25)
	(= (time-to-walk p2-0 s0) 25)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 11)
	(= (time-to-walk p3-0 s3) 11)
	(= (time-to-walk s0 p3-0) 20)
	(= (time-to-walk p3-0 s0) 20)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 26)
	(= (time-to-walk p3-2 s3) 26)
	(= (time-to-walk s2 p3-2) 27)
	(= (time-to-walk p3-2 s2) 27)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 4)
	(= (time-to-walk p4-0 s4) 4)
	(= (time-to-walk s0 p4-0) 4)
	(= (time-to-walk p4-0 s0) 4)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 28)
	(= (time-to-walk p4-3 s4) 28)
	(= (time-to-walk s3 p4-3) 39)
	(= (time-to-walk p4-3 s3) 39)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 2)
	(= (time-to-walk p4-5 s4) 2)
	(= (time-to-walk s5 p4-5) 18)
	(= (time-to-walk p4-5 s5) 18)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 39)
	(= (time-to-walk p6-2 s6) 39)
	(= (time-to-walk s2 p6-2) 6)
	(= (time-to-walk p6-2 s2) 6)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 30)
	(= (time-to-walk p6-4 s6) 30)
	(= (time-to-walk s4 p6-4) 14)
	(= (time-to-walk p6-4 s4) 14)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 20)
	(= (time-to-drive s0 s5) 20)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 11)
	(= (time-to-drive s2 s5) 11)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 24)
	(= (time-to-drive s4 s5) 24)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 36)
	(= (time-to-drive s2 s1) 36)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 33)
	(= (time-to-drive s5 s1) 33)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 16)
	(= (time-to-drive s1 s0) 16)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 31)
	(= (time-to-drive s2 s0) 31)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 12)
	(= (time-to-drive s6 s0) 12)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 17)
	(= (time-to-drive s0 s3) 17)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 27)
	(= (time-to-drive s4 s3) 27)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 3)
	(= (time-to-drive s6 s3) 3)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 23)
	(= (time-to-drive s2 s6) 23)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 22)
	(= (time-to-drive s0 s4) 22)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 36)
	(= (time-to-drive s1 s4) 36)
	(= (fuel-used) 0)
)
	(:goal (and
	(at truck2 s3)
	(at truck3 s2)
	(at package1 s3)
	(at package2 s1)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver1 s1 p5-1)
   deleted: (at driver1 s1)
   added: (at driver1 p5-1)
   goals met: 1 of 4
2. (walk driver1 p5-1 s5)
   deleted: (at driver1 p5-1)
   added: (at driver1 s5)
   goals met: 1 of 4
3. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 4
4. (drive-truck truck2 s5 s0 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (fuel-used) from 0 to 200
   goals met: 1 of 4
5. (load-truck package2 truck2 s0)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 4
6. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 200 to 376
   goals met: 1 of 4
7. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 2 of 4
8. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 376 to 536
   goals met: 2 of 4
9. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 536 to 706
   goals met: 3 of 4
10. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 3 of 4
11. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 4
12. (drive-truck truck3 s3 s0 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 706 to 876
   goals met: 3 of 4
13. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 876 to 1186
   goals met: 4 of 4
